# Description 

Cette règle sera levée en cas de changement de mot de passe d'un compte.

# Criticité : **LOW**

# Outils

Sysmon

# Règle SPL

```
index=test source=WinEventLog:Security EventCode=4723
| eval severity="Low"
| eval event_title="Changement du mot de passe d'un compte"
```

# Règle SIGMA

```
title: Changement de mot de passe d'un compte
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4723
  condition: selection
level: low
description: Détecte les changements de mot de passe d'un compte
```

# Explication

Cette règle détecte les changements de mot de passe d'un compte en surveillant les événements de sécurité Windows (EventID 4723).