title: Changement de mot de passe d'un compte administrateur
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4723
  condition: selection
level: low
description: Détecte les changements de mot de passe d'un compte




index=test source=WinEventLog:Security EventCode=4723
| eval severity="Low"
| eval event_title="Changement du mot de passe d'un compte"