title: Détection de l'ajout d'un utilisateur dans un groupe privilégié
id: 9f3c2d8b-5b37-4a7b-8e32-bc3b541a8e9d
status: experimental
description: Cette règle détecte l'ajout d'un utilisateur dans un groupe privilégié, ce qui peut indiquer une tentative d'escalade de privilèges.
author: Jules S.
date: 2024-11-07
tags:
    - attack.t1078
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4672
    condition: selection
fields:
    - _time
    - EventID
    - GroupName
    - TargetUserName
    - src_ip
falsepositives:
    - Ajout légitime d'un utilisateur par un administrateur
level: medium





index="connectix"  sourcetype="wineventlog" EventCode=4672
| eval severity="Medium"
| eval event_title="Ajout des droits administrateurs à un utilisateur"