# Description 

Cette règle sera levée en cas de tentative de connexion échouée avec un compte désactivé.

# Criticité : **MEDIUM**

# Outils

Sysmon

# Règle SPL

```
index=test EventCode=4625 Status="C0000072"
| eval severity="Medium"
| eval event_title="Détection d'une tentative de connexion par un compte désactivé"
```

# Règle SIGMA

```
title: Tentative de connexion par un compte désactivé
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4625
    Status: "C0000072"
  condition: selection
level: medium
description: Détecte les tentatives de connexion échouées avec un compte désactivé.
```

# Explication

Cette règle détecte les tentatives de connexion échouées où le statut de l'utilisateur est "C0000072", ce qui indique que le compte est désactivé, et ainsi, la tentative de connexion est rejetée.