title: Processus masqué par cmd.exe
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    ParentImage: ""*\\cmd.exe""
    User: "!SYSTEM"  # Exclure les utilisateurs système
  condition: selection
level: medium
description: Détecte des processus lancés par cmd.exe, potentiellement pour dissimuler des commandes.





index=test EventCode=1 ParentImage="*\\cmd.exe"
| stats count by _time, Computer, User, ParentImage, Image
| rename Computer as host, User as user, ParentImage as parent_image, Image as image
| eval severity="medium"
| eval event_title="Détection d'un processus masqué par cmd.exe"