# Description

Détecte la suppression de comptes utilisateurs, une action qui peut être utilisée pour masquer l'activité de comptes compromis. Cette suppression peut être le signe d'une tentative d'effacement de traces ou de compromission d'accès.

# Criticité : LOW

# Outils

Sysmon

# Règle SPL

index=test source=WinEventLog:Security EventCode=4726
| eval severity="Low"
| eval event_title="Suppression d'un compte utilisateur"

# Règle SIGMA

title: Suppression d'un compte utilisateur
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4726
  condition: selection
level: low
description: Détecte la suppression de comptes utilisateurs, souvent utilisée pour masquer l'activité de comptes compromis.

# Explication

Cette règle SIGMA permet de détecter les événements de suppression de comptes utilisateurs. Elle s'appuie sur EventID 4726, un événement de sécurité enregistré dans Windows lorsque l’action de suppression de compte est exécutée. Bien que la suppression d’un compte puisse parfois être légitime, elle est souvent associée à des tentatives de dissimulation d'activité malveillante, notamment en cas de compromission de comptes.

