# Description

Cette règle détecte l'ajout ou la modification d'un fichier dans des répertoires Windows utilisés pour exécuter des programmes au démarrage, ce qui peut indiquer une tentative de persistance malveillante.

# Criticité : LOW

# Outils

    SIEM : pour l'agrégation et la surveillance des événements Sysmon.
    EDR : pour surveiller les modifications de fichiers dans des répertoires critiques.
    Sysmon : pour configurer une règle de surveillance sur les répertoires de démarrage de Windows et détecter les changements.

# Règle SPL

index=connectix source="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=11 
(TargetFilename="*\\Users\\*\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup" 
OR TargetFilename="*\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\Startup")
| eval severity="Low"
| eval event_title="Ajout d'un programme au démarrage"

# Règle SIGMA

title: Détection de l'ajout ou de la modification de fichiers dans des répertoires Windows destinés à exécuter des programmes au démarrage
id: a45e95f6-dec4-43ab-b3ba-91471e993c9a
status: experimental
description: Cette règle détectera l'ajout ou modification d'un fichier dans des répertoires Windows destinés à exécuter des programmes au démarrage.
author: Jules S.
date: 2024-09-16
tags:
    - attack.t1547.001
logsource:
    product: windows
    category: sysmon
detection:
    selection1:
        TargetFilename|contains: "\\Users\\*\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup"
    selection2:
        TargetFilename|contains: "ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\Startup"
    condition: selection1 or selection2
falsepositives:
    - Lancement de logiciels légitimes au démarrage mis en place à l'installation d'un programme
level: low



# Explication

Cette règle SIGMA permet de détecter les modifications de fichiers dans les répertoires de démarrage de Windows, tels que AppData\Roaming\Microsoft\Windows\Start Menu\Programs\Startup et ProgramData\Microsoft\Windows\Start Menu\Programs\Startup. Toute modification dans ces répertoires peut indiquer une tentative de persistance par un logiciel malveillant, bien que des logiciels légitimes puissent aussi y ajouter des éléments lors de leur installation.