# Description

Cette règle détecte l'arrêt du pare-feu Windows, une action qui pourrait indiquer une tentative de désactivation de la sécurité réseau, compromettant ainsi la protection contre les connexions non autorisées.

# Criticité : MEDIUM

# Outils

Sysmon

# Règle SPL

index="connectix" sourcetype=WinEventLog EventCode=5025
| eval severity="Medium"
| eval event_title="Arrêt du pare-feu Windows"

# Règle SIGMA

title: Détection de l'arrêt du pare-feu Windows
id: b67f8c3e-3a21-4b8e-9f2c-8d9e3a8c9c1a
status: experimental
description: Cette règle détecte l'arrêt du pare-feu Windows, ce qui peut indiquer une tentative de désactivation de la sécurité réseau.
tags:
    - attack.t1562.004
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5025
        Provider_Name: "Microsoft-Windows-Windows Firewall With Advanced Security"
    condition: selection
falsepositives:
    - Arrêt légitime pour maintenance ou mise à jour système
level: medium

# Explication

Cette règle SIGMA permet de détecter les événements où le pare-feu Windows est désactivé. L'événement spécifique, EventID 5025, est déclenché lorsque le pare-feu est arrêté, avec Provider_Name correspondant à "Microsoft-Windows-Windows Firewall With Advanced Security". Ce type de désactivation peut être le signe d'une tentative d'affaiblissement de la sécurité réseau, bien qu'il existe des faux positifs, notamment lors de la maintenance ou de mises à jour légitimes du système.
